# WinderParallelTreadsNumberFailure Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..WinderParallelTreadsNumberFailure Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Cannot satisfy the number of Parallel Treads at the Start or End as specified in the Run Instance properties
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WinderParallelTreadsNumberFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WinderParallelTreadsNumberFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WinderParallelTreadsNumberFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace